//LNACCR01 JOB (LEND,BATCH),'LOAN ACCRUAL',CLASS=A,MSGCLASS=X,
//         NOTIFY=&SYSUID
//*-------------------------------------------------------------------
//* MONTHLY LOAN ACCRUAL.  PARM = AS-OF DATE CCYYMMDD (PERIOD END).
//* STEP020 SHIPS THE OUTPUT TO THE DISTRIBUTED SIDE FOR THE SHADOW
//* RECONCILIATION (SEE DOCS/FILE-TRANSFER-NOTES.MD IN PYLEDGER).
//*-------------------------------------------------------------------
//STEP010  EXEC PGM=LNACCR01,PARM='20240331'
//STEPLIB  DD DSN=LEND.PROD.LOADLIB,DISP=SHR
//LNMAST   DD DSN=LEND.PROD.LNMAST.G0147V00,DISP=SHR
//LNTRAN   DD DSN=LEND.PROD.LNTRAN.D240331,DISP=SHR
//RATETBL  DD DSN=LEND.PROD.RATETBL.D240301,DISP=SHR
//HOLIDAY  DD DSN=LEND.PROD.HOLIDAY.Y2024,DISP=SHR
//LNOUT    DD DSN=LEND.PROD.LNOUT.D240331,DISP=(NEW,CATLG,DELETE),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920),
//            SPACE=(CYL,(5,1),RLSE)
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//*
//STEP020  EXEC PGM=MFTSEND,COND=(0,NE)
//SYSIN    DD *
  SEND DSN=LEND.PROD.LNOUT.D240331 PROFILE=LNOUT-ASCII-LF
  SEND DSN=LEND.PROD.LNMAST.G0147V00 PROFILE=LNMAST-MIXED
  SEND DSN=LEND.PROD.LNTRAN.D240331 PROFILE=DISPLAY-ASCII-LF
  SEND DSN=LEND.PROD.RATETBL.D240301 PROFILE=DISPLAY-ASCII-LF
/*
